// Import stylesheets
// import "./style.css";

// Check Yourself!

// Задание №1
// Создайте функцию которая принимает в качестве
// аргумента два числа и возвращает их сумму.
// let arr = [23, 11];
// let sum = 0;
// for (let i of arr) {
//   sum += i;
// }
// console.log(sum);

// Задание №2
// Напишите функцию которая принимает
// массив с названиями стран и возвращает
// страну с самым длинным названием,
// затем напишите вторую функцию которая возвращает
// страну с самым коротким названием.
// let arr = ["Apple", "Orange", "Banana", "Pineapple", "Cherry"];
// let max = arr[0];
// for (let i of arr) {
//   if (max.length < i.length) {
//     max = i;
//   }
// }
// console.log(max);
// let arr = ["Apple", "Orange", "Banana", "Pineapple", "Cherry"];
// let min = arr[0];
// for (let i of arr) {
//   if (min.length > i.length) {
//     min = i;
//   }
// }
// console.log(min);

// Задание №3
// Функция принимает параметр min.
// В нем лежит число от 0 до 59.
// Функция должна возвращать в какую четверть
// часа попадает это число (в первую, вторую,
// третью или четвертую).
// for (let i = 0; i <= 59; i++) {
//     console.log(i);
//   }
// Задание №4
// Создайте функцию которая принимает строку, удаляет все гласные буквы из строки,
// а согласные буквы в свою очередь переводит в заглавные и возвращает новую строку.
// Например: ввод - 'hello', функция должна возвратить 'HLL'
// let str = "Hello";
// for (let i = 0; i < str.length; i++) {
//   if (i % 2 === 0) console.log(str[i].toUpperCase(str[i]));
// }
// Задание №5
// Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// #
// ##
// ###
// ####
// #####
// ######
// #######
// ######
// #####
// ####
// ###
// ##
// #
// let str = "";
// for (let i = 1; i <= 7; i++) {
//   str += "#";
//   console.log(str);
// }
// for (let i = 6; i >= 1; i--) {
//   str = str.slice(0, -1);
//   console.log(str);
// }
// Задание №6
// let arr = [1, 2, 3, 3, 4, 5];
// res=arr.indexOf()
// console.log(res);

// Найти индекс второго числа 
