// Import stylesheets
// import "./style.css";

// Check Yourself!

// Задание №1
// Создайте функцию которая принимает в качестве
// аргумента два числа и возвращает их сумму.
// let n1 = 20;
// let n2 = 10;
// res = n1 + n2;
// console.log(res);

// Задание №2
// Напишите функцию которая принимает
// массив с названиями стран и возвращает
// страну с самым длинным названием,
// затем напишите вторую функцию которая возвращает
// страну с самым коротким названием.
// let arr = ["Apple", "Orange", "Banana", "Pineapple", "Cherry"];
// let max = [0];
// for (let i of arr) {
//   if (max.length < i.length) {
//     max = i;
//   }
// }
// console.log(max);
// let arr = ["Apple", "Orange", "Banana", "Pineapple", "Cherry"];
// let min = [0];
// for (let i of arr) {
//   if (min.length > i.length) {
//     min = i;
//   }
// }
// console.log(min);

// Задание №3
// Функция принимает параметр min.
// В нем лежит число от 0 до 59.
// Функция должна возвращать в какую четверть
// часа попадает это число (в первую, вторую,
// третью или четвертую).

// Задание №4
// Создайте функцию которая принимает строку, удаляет все гласные буквы из строки,
// а согласные буквы в свою очередь переводит в заглавные и возвращает новую строку.
// Например: ввод - 'hello', функция должна возвратить 'HLL'

// Задание №5
// Напишите цикл, который за 7 вызовов console.log выводит такой треугольник:

// #
// ##
// ###
// ####
// #####
// ######
// #######
// ######
// #####
// ####
// ###
// ##
// #
// let str = "";
// for (let i = 1; i <= 7; i++) {
//   console.log((str += "#"));
// }
// for (let i = 6; i >= 1; i--) {
//   str = str.slice(0, -1);
//   console.log(str);
// }
// Задание №6
// let arr = [1, 2, 3, 3, 4, 5];
// res=arr.indexOf()
// console.log(res);

// Найти индекс второго числа 3
